target/test-classes/xml/ows/onlines_CC_customer_with_3_subscriptions(1FC_2NC).xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <createOrder type="NEW" xmlns="http://order.telco.hsntech.com">
      <account xmlns="">
        <contact>
          <title>Mr</title>
          <firstName></firstName>
          <lastName></lastName>
          <telephoneNumbers defaultContact="daytime">
            <daytime>0398403850</daytime>
            <evening>0208619999</evening>
            <mobile>02086999990</mobile>
          </telephoneNumbers>
          <emailAddress></emailAddress>
          <birthDate>1975-01-01</birthDate>
        </contact>
        <billingAddress>
          <buildingIdentifier>6</buildingIdentifier>
          <addressLine1>LUKIN STREET</addressLine1>
          <town>LONDON</town>
          <country>United Kingdom</country>
          <postcode>E10AA</postcode>
          <ptc_abs_code>PTCABS3075103</ptc_abs_code>
          <startDate>1980-08-08</startDate>
        </billingAddress>
        <accountDetail>
          <username></username>
          <password>password3</password>
          <securityQuestion>Mothers maiden name?</securityQuestion>
          <securityAnswer>smith</securityAnswer>
        </accountDetail>
        <billingDetail>
          <billGroupId>422</billGroupId>
          <preferredNotification>SMS</preferredNotification>
          <paymentDetail type="CARD">
            <creditCard>
              <cardName>CardName</cardName>
              <cardNumber>5105105105105100</cardNumber>
              <cardType>MC</cardType>
              <cardExpiryDate>1230</cardExpiryDate>
              <cardStartDate>0110</cardStartDate>
              <cvv>123</cvv>
            </creditCard>
          </paymentDetail>
          <billFormat>SUMMARY</billFormat>
          <clubcardNumber>634143330730912784</clubcardNumber>
        </billingDetail>
      </account>
      <verification runCreditCheck="false" termsAndConditionsAccepted="true" xmlns="">
        <interconnect>
          <param name="PAYASYOUGO"/>
        </interconnect>
      </verification>
      <orderDetail externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" ipAddress="160.206.234.22" orderRef="12345" agentId="AmeeCare01" salesChannel="Care (CSA)" paymentMethod="CARD" xmlns="">
        <dateTime>2011-06-10T00:00:00</dateTime>
        <orderItem dealSKU="DEAL-INHAND" masterSubscription="true" id="1">
          <serviceRef reference="Mobile FC"/>
          <tariff productCode="FC12-1000-500SO">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="SIM-ONLY">
            <deliveryMethod>DELIVER</deliveryMethod>
          </device>
          <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
        </orderItem>
        <orderItem dealSKU="DEAL-INHAND" id="2">
          <serviceRef reference="Mobile NC"/>
          <tariff productCode="NC1-1000-250">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="SIM-ONLY">
            <deliveryMethod>DELIVER</deliveryMethod>
          </device>
        </orderItem>
        <orderItem dealSKU="DEAL-INHAND" id="3">
          <serviceRef reference="Mobile NC 2"/>
          <tariff productCode="NC1-1000-250">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="SIM-ONLY">
            <deliveryMethod>DELIVER</deliveryMethod>
          </device>
        </orderItem>
        <paymentRequest>
          <cardName>CardName</cardName>
          <cardNumber>5105105105105100</cardNumber>
          <cardType>MC</cardType>
          <cardExpiryDate>1230</cardExpiryDate>
          <cardStartDate>0110</cardStartDate>
          <cvv>123</cvv>
        </paymentRequest>
      </orderDetail>
    </createOrder>
  </s:Body>
</s:Envelope>